InformationRegisters/СведенияОСтавкахИПНиСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахИПНиСН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоходаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалогаПредыдущегоПредела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтавокИПНиСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокИПНиСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахИПНиСН/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокументов",	Выгрузить(, "ВидСтавокИПНиСН, Период, СуммаДоходаПо, СуммаДоходаС, СуммаНалогаПредыдущегоПредела"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокументов.ВидСтавокИПНиСН КАК ВидСтавокИПНиСН,
	|	ТаблицаДокументов.Период КАК Период,
	|	ТаблицаДокументов.СуммаДоходаПо КАК СуммаДоходаПо,
	|	ТаблицаДокументов.СуммаДоходаС,
	|	ТаблицаДокументов.СуммаНалогаПредыдущегоПредела
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтавокИПНиСН,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОСтавкахИПНиСН.НомерСтрокиСтавок,
	|	СведенияОСтавкахИПНиСН.СуммаДоходаС,
	|	СведенияОСтавкахИПНиСН.СуммаДоходаПо КАК СуммаДоходаПо,
	|	СведенияОСтавкахИПНиСН.СуммаНалогаПредыдущегоПредела,
	|	СведенияОСтавкахИПНиСН.Ставка,
	|	ДокументыСрез.ВидСтавокИПНиСН,
	|	ДокументыСрез.Период
	|ИЗ
	|	РегистрСведений.СведенияОСтавкахИПНиСН КАК СведенияОСтавкахИПНиСН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ДокументыСрез
	|		ПО СведенияОСтавкахИПНиСН.ВидСтавокИПНиСН = ДокументыСрез.ВидСтавокИПНиСН
	|			И СведенияОСтавкахИПНиСН.Период = ДокументыСрез.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущийПредел = 0;
	ПредыдущаяСтрока = Неопределено;	

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НомерСтрокиСтавок = 1 И Выборка.СуммаДоходаС <> 0 Тогда
			ТекстСообщения = НСтр("ru='Нижний предел по первой строке должен быть нулевым'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ЭтотОбъект", ,Отказ);
		КонецЕсли;
		
		Если ПредыдущийПредел <> Выборка.СуммаДоходаС Тогда
			ТекстСообщения = НСтр("ru='В строке "+Выборка.НомерСтрокиСтавок+" нижний предел не совпадает с верхним пределом предыдущей строки'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ЭтотОбъект", ,Отказ);
		КонецЕсли;
		
		Если Выборка.СуммаДоходаС >= Выборка.СуммаДоходаПо Тогда
			ТекстСообщения = НСтр("ru='В строке "+Выборка.НомерСтрокиСтавок+" верхний предел должен быть больше нижнего'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ЭтотОбъект", ,Отказ);
		КонецЕсли;
		
		// запомним для следующей итерации
		ПредыдущийПредел = Выборка.СуммаДоходаПо;
		ПредыдущаяСтрока = Выборка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
